cask_args appdir: "/Applications"

# Build tools and compilers
brew "gcc"
brew "cmake"
brew "llvm"
brew "pkg-config"
brew "openblas"
brew "libomp"
# SSH FIDO2 support (runtime dependency for sk-libfido2.dylib)
brew "libfido2"

# Shell and CLI
brew "zsh"
brew "antidote"

# Modern CLI tools
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "zoxide"
brew "fzf"
brew "tlrc"
brew "delta"
brew "terminal-notifier"
brew "pinentry-mac"
brew "mole"

# Version control
brew "git"
brew "git-lfs"
brew "git-filter-repo"
brew "gh"

# Languages
brew "python3"
brew "uv"
brew "oven-sh/bun/bun"
brew "direnv"

# Documents
brew "pandoc"

# Libraries for R compilation
brew "libtiff"
brew "libpng"
brew "jpeg-turbo"
brew "freetype"
brew "openssl"
brew "mbedtls"
brew "zstd"

# Casks
cask "1password-cli"
cask "1password"
cask "dropbox"
cask "alfred"
cask "ghostty"
cask "little-snitch"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "spotify"
cask "hazel"
cask "zoom"
cask "slack"
cask "notion"
cask "microsoft-office"
cask "r-app"
cask "mactex-no-gui"
